/*************************************************************************
	> File Name: page_sort_redundant.cpp
	> Author: Dream9
	> Brief: 
	> Created Time: 2019年07月05日 星期五 16时12分18秒
 ************************************************************************/

#include"page_sort_redundant.h"

//////////////////////////////////////////////
//////////////////////////////////////////////
//////////////////////////////////////////////
/////以下所有内容对于pagesort没有任何意义/////
//////////////////////////////////////////////
//////////////////////////////////////////////
std::map<uint32_t,uint32_t> mapIpBlock;
std::mutex mutexVisitedUrlMd5;
std::unordered_set<string> setVisitedUrlMd5;

